In [2]:
import pandas as pd
import numpy as np

In [17]:
df = pd.DataFrame({"id":[1,2,3,4,5],
                   "name":['a','b','c','d','e'],
                   "design":['IT','HR','IT','HR','HR'],
                   "sal":[45,767,np.nan,45,np.nan]})

In [13]:
def sal_encode(dept):
    if dept=='IT':
        return 500
    elif dept=='HR':
        return 400
    else:
        return sal

In [14]:
df['dept_sal_encode'] =  df['sal'].map(sal_encode(df.design))

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [18]:
import numpy as np

df['sal1'] = df['design'].map({'IT': 400, 'HR': 500}).fillna(df['sal'])

In [19]:
df

   id name design    sal  sal1
0   1    a     IT   45.0   400
1   2    b     HR  767.0   500
2   3    c     IT    NaN   400
3   4    d     HR   45.0   500
4   5    e     HR    NaN   500

In [20]:
df['sal'] = df['design'].map({'IT': 45, 'HR': 50}).fillna(df['sal'])

In [21]:
df

   id name design  sal  sal1
0   1    a     IT   45   400
1   2    b     HR   50   500
2   3    c     IT   45   400
3   4    d     HR   50   500
4   5    e     HR   50   500

In [22]:
df = pd.read_csv("temp.csv")

In [27]:
df.groupby('product').agg('price').sum()

product
Keyboard     165
Laptop      5150
Monitor      630
Mouse         39
Name: price, dtype: int64

In [30]:
df.groupby('product').agg("quantity").sum()

product
Keyboard    11
Laptop       5
Monitor      4
Mouse       23
Name: quantity, dtype: int64

In [40]:
df.groupby(["customer","region","sale_date","product"]).agg("price").sum()

customer  region  sale_date   product
Alice     East    2024-01-16  Keyboard      45
          North   2024-01-05  Laptop      1200
                  2024-01-10  Monitor      200
          South   2024-01-23  Mouse          9
Bob       South   2024-01-07  Keyboard      40
                  2024-01-17  Monitor      210
Charlie   East    2024-01-08  Mouse         10
                  2024-01-21  Laptop      1250
David     West    2024-01-12  Laptop      1300
                  2024-01-25  Monitor      220
Eva       East    2024-01-26  Keyboard      38
          South   2024-01-12  Mouse          8
          West    2024-01-20  Laptop      1400
Frank     North   2024-01-15  Mouse         12
                  2024-01-22  Keyboard      42
Name: price, dtype: int64

In [44]:
df.groupby('customer').agg("price").sum()

customer
Alice      1454
Bob         250
Charlie    1260
David      1520
Eva        1446
Frank        54
Name: price, dtype: int64

In [45]:
df

    order_id customer region   product  quantity  price   sale_date
0          1    Alice  North    Laptop         1   1200  2024-01-05
1          2      Bob  South  Keyboard         3     40  2024-01-07
2          3  Charlie   East     Mouse         5     10  2024-01-08
3          4    Alice  North   Monitor         2    200  2024-01-10
4          5    David   West    Laptop         1   1300  2024-01-12
5          6      Eva  South     Mouse        10      8  2024-01-12
6          7    Frank  North     Mouse         2     12  2024-01-15
7          8    Alice   East  Keyboard         1     45  2024-01-16
8          9      Bob  South   Monitor         1    210  2024-01-17
9         10      Eva   West    Laptop         1   1400  2024-01-20
10        11  Charlie   East    Laptop         2   1250  2024-01-21
11        12    Frank  North  Keyboard         4     42  2024-01-22
12        13    Alice  South     Mouse         6      9  2024-01-23
13        14    David   West   Monitor         1    220  2024-01-25
14        15      Eva   East  Keyboard         3     38  2024-01-26